### Report for environment: ndr-dev

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- access-audit-alarm in modules/lambda_alarms
- access-audit-alarm-topic in modules/sns
- access-audit-gateway in modules/gateway
- access-audit-lambda in modules/lambda
- access_audit_dynamodb_table in modules/dynamo_db
- alarm_state_history_table in modules/dynamo_db
- api_endpoint_url_ssm_parameter in modules/ssm_parameter
- auth_session_dynamodb_table in modules/dynamo_db
- auth_state_dynamodb_table in modules/dynamo_db
- authoriser-alarm in modules/lambda_alarms
- authoriser-alarm-topic in modules/sns
- authoriser-lambda in modules/lambda
- back-channel-logout-gateway in modules/gateway
- back_channel_logout_alarm in modules/lambda_alarms
- back_channel_logout_alarm_topic in modules/sns
- back_channel_logout_lambda in modules/lambda
- bulk-upload-alarm in modules/lambda_alarms
- bulk-upload-alarm-topic in modules/sns
- bulk-upload-lambda in modules/lambda
- bulk-upload-metadata-alarm in modules/lambda_alarms
- bulk-upload-metadata-alarm-topic in modules/sns
- bulk-upload-metadata-lambda in modules/lambda
- bulk-upload-report-alarm in modules/lambda_alarms
- bulk-upload-report-alarm-topic in modules/sns
- bulk-upload-report-lambda in modules/lambda
- bulk_upload_metadata_preprocessor_lambda in modules/lambda
- bulk_upload_report_dynamodb_table in modules/dynamo_db
- cloudfront-distribution-lg in modules/cloudfront
- cloudfront_edge_dynamodb_table in modules/dynamo_db
- cloudfront_firewall_waf_v2 in modules/firewall_waf_v2
- create-doc-ref-gateway in modules/gateway
- create-doc-ref-lambda in modules/lambda
- create-token-gateway in modules/gateway
- create-token-lambda in modules/lambda
- create_doc_alarm in modules/lambda_alarms
- create_doc_alarm_topic in modules/sns
- create_token-alarm in modules/lambda_alarms
- create_token-alarm_topic in modules/sns
- data-collection-alarm in modules/lambda_alarms
- data-collection-alarm-topic in modules/sns
- data-collection-lambda in modules/lambda
- delete-doc-ref-gateway in modules/gateway
- delete-doc-ref-lambda in modules/lambda
- delete-document-object-alarm in modules/lambda_alarms
- delete-document-object-alarm-topic in modules/sns
- delete-document-object-lambda in modules/lambda
- delete_doc_alarm in modules/lambda_alarms
- delete_doc_alarm_topic in modules/sns
- document-manifest-job-gateway in modules/gateway
- document-manifest-job-lambda in modules/lambda
- document_manifest_alarm in modules/lambda_alarms
- document_manifest_alarm_topic in modules/sns
- document_reference_dynamodb_table in modules/dynamo_db
- edge-presign-lambda in modules/lambda_edge
- edge_presign_alarm in modules/lambda_alarms
- edge_presign_alarm_topic in modules/sns
- feature-flags-gateway in modules/gateway
- feature-flags-lambda in modules/lambda
- feature_flags_alarm in modules/lambda_alarms
- feature_flags_alarm_topic in modules/sns
- firewall_waf_v2 in modules/firewall_waf_v2
- generate-document-manifest-alarm in modules/lambda_alarms
- generate-document-manifest-alarm-topic in modules/sns
- generate-document-manifest-lambda in modules/lambda
- generate-lloyd-george-stitch-alarm in modules/lambda_alarms
- generate-lloyd-george-stitch-alarm-topic in modules/sns
- generate-lloyd-george-stitch-lambda in modules/lambda
- get-doc-nrl-lambda in modules/lambda
- get-report-by-ods-alarm in modules/lambda_alarms
- get-report-by-ods-alarm-topic in modules/sns
- get-report-by-ods-gateway in modules/gateway
- get-report-by-ods-lambda in modules/lambda
- im-alerting-lambda in modules/lambda
- lambda-layer-core in modules/lambda_layers
- lambda-layer-data in modules/lambda_layers
- lloyd-george-stitch-gateway in modules/gateway
- lloyd-george-stitch-lambda in modules/lambda
- lloyd-george-stitch_alarm in modules/lambda_alarms
- lloyd-george-stitch_topic in modules/sns
- lloyd_george_reference_dynamodb_table in modules/dynamo_db
- login_redirect-alarm_topic in modules/sns
- login_redirect_alarm in modules/lambda_alarms
- login_redirect_lambda in modules/lambda
- logout-gateway in modules/gateway
- logout_alarm in modules/lambda_alarms
- logout_alarm_topic in modules/sns
- logout_lambda in modules/lambda
- manage-nrl-pointer-alarm in modules/lambda_alarms
- manage-nrl-pointer-alarm-topic in modules/sns
- manage-nrl-pointer-lambda in modules/lambda
- mns-dlq-alarm-topic in modules/sns
- mns-notification-alarm in modules/lambda_alarms
- mns-notification-alarm-topic in modules/sns
- mns-notification-lambda in modules/lambda
- mns_encryption_key in modules/kms
- ndr-app-config in modules/app_config
- ndr-bulk-staging-store in modules/s3
- ndr-docker-ecr-data-collection in modules/ecr
- ndr-docker-ecr-ui in modules/ecr
- ndr-document-store in modules/s3
- ndr-ecs-container-port-ssm-parameter in modules/ssm_parameter
- ndr-ecs-fargate-app in modules/ecs
- ndr-ecs-fargate-data-collection in modules/ecs
- ndr-feedback-mailbox in modules/ses
- ndr-lloyd-george-store in modules/s3
- ndr-vpc-ui in modules/vpc
- ndr-zip-request-store in modules/s3
- nhs-oauth-token-generator-alarm in modules/lambda_alarms
- nhs-oauth-token-generator-alarm-topic in modules/sns
- nhs-oauth-token-generator-lambda in modules/lambda
- nrl-dlq-alarm-topic in modules/sns
- pdf-stitching-alarm-topic in modules/sns
- pdf-stitching-lambda in modules/lambda
- pdf-stitching-lambda-alarms in modules/lambda_alarms
- route53_fargate_ui in modules/route53
- search-document-references-gateway in modules/gateway
- search-document-references-lambda in modules/lambda
- search-patient-details-gateway in modules/gateway
- search-patient-details-lambda in modules/lambda
- search_doc_alarm in modules/lambda_alarms
- search_doc_alarm_topic in modules/sns
- search_patient_alarm_topic in modules/sns
- send-feedback-alarm in modules/lambda_alarms
- send-feedback-alarm-topic in modules/sns
- send-feedback-gateway in modules/gateway
- send-feedback-lambda in modules/lambda
- sns_encryption_key in modules/kms
- sqs-lg-bulk-upload-invalid-queue in modules/sqs
- sqs-lg-bulk-upload-metadata-queue in modules/sqs
- sqs-mns-notification-queue in modules/sqs
- sqs-nrl-queue in modules/sqs
- sqs-splunk-queue in modules/sqs
- sqs-stitching-queue in modules/sqs
- statistical-report-alarm in modules/lambda_alarms
- statistical-report-alarm-topic in modules/sns
- statistical-report-lambda in modules/lambda
- statistical-reports-store in modules/s3
- statistics_dynamodb_table in modules/dynamo_db
- stitch_metadata_reference_dynamodb_table in modules/dynamo_db
- stitching-dlq-alarm-topic in modules/sns
- unstitched_lloyd_george_reference_dynamodb_table in modules/dynamo_db
- update-upload-state-gateway in modules/gateway
- update-upload-state-lambda in modules/lambda
- update_upload_state_alarm in modules/lambda_alarms
- update_upload_state_alarm_topic in modules/sns
- upload_confirm_result_alarm in modules/lambda_alarms
- upload_confirm_result_alarm_topic in modules/sns
- upload_confirm_result_gateway in modules/gateway
- upload_confirm_result_lambda in modules/lambda
- virus_scan_result_alarm in modules/lambda_alarms
- virus_scan_result_alarm_topic in modules/sns
- virus_scan_result_gateway in modules/gateway
- virus_scan_result_lambda in modules/lambda
- zip_store_reference_dynamodb_table in modules/dynamo_db
Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding hashicorp/aws versions matching "~> 5.0"...
- Finding latest version of hashicorp/archive...
- Installing hashicorp/aws v5.98.0...
- Installed hashicorp/aws v5.98.0 (signed by HashiCorp)
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.


Warning: Reference to undefined provider

  on cloudfront.tf line 8, in module "cloudfront_firewall_waf_v2":
   8:   providers   = { aws = aws.us_east_1 }

There is no explicit declaration for local provider name "aws" in
module.cloudfront_firewall_waf_v2, so Terraform is assuming you mean to pass
a configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)
Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan ()</summary>

```

module.pdf-stitching-lambda.data.archive_file.lambda: Reading...
module.mns-notification-lambda[0].data.archive_file.lambda: Reading...
module.im-alerting-lambda.data.archive_file.lambda: Reading...
module.edge-presign-lambda.data.archive_file.lambda: Reading...
module.bulk-upload-metadata-lambda.data.archive_file.lambda: Reading...
module.delete-document-object-lambda.data.archive_file.lambda: Reading...
module.nhs-oauth-token-generator-lambda.data.archive_file.lambda: Reading...
module.lambda-layer-core.data.archive_file.lambda_layer_placeholder: Reading...
module.edge-presign-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.delete-document-object-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.nhs-oauth-token-generator-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.bulk-upload-metadata-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.im-alerting-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.pdf-stitching-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.mns-notification-lambda[0].data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.bulk_upload_metadata_preprocessor_lambda.data.archive_file.lambda: Reading...
module.lambda-layer-data.data.archive_file.lambda_layer_placeholder: Reading...
module.lambda-layer-core.data.archive_file.lambda_layer_placeholder: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.bulk-upload-report-lambda.data.archive_file.lambda: Reading...
module.lambda-layer-data.data.archive_file.lambda_layer_placeholder: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.bulk-upload-report-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.bulk_upload_metadata_preprocessor_lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.edge-presign-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.edge-presign-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1349007126]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_ssm_parameter.slack_alerting_channel_id: Reading...
module.pdf-stitching-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.pdf-stitching-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.ndr-vpc-ui.data.aws_vpc.vpc[0]: Reading...
module.route53_fargate_ui.data.aws_route53_zone.ndr_zone[0]: Reading...
module.ndr-ecs-fargate-app.data.aws_acm_certificate.amazon_issued[0]: Reading...
module.mns-notification-lambda[0].data.aws_iam_policy_document.assume_role: Reading...
module.mns-notification-lambda[0].data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.splunk_trusted_principal[0]: Reading...
data.aws_ssm_parameter.splunk_trusted_principal[0]: Read complete after 0s [id=/prs/user-input/external/splunk-trusted-principal]
module.route53_fargate_ui.data.aws_route53_zone.ndr_zone[0]: Read complete after 0s [id=Z03876441EL64PCVENJO8]
data.aws_ssm_parameter.cloud_security_notification_email_list: Reading...
data.aws_ssm_parameter.cloud_security_notification_email_list: Read complete after 0s [id=/prs/dev/user-input/cloud-security-notification-email-list]
data.aws_ssm_parameter.apim_url: Reading...
module.bulk-upload-metadata-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.bulk-upload-metadata-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.apim_url: Read complete after 0s [id=/repo/dev/user-input/apim-api-url]
data.aws_ssm_parameter.slack_alerting_bot_token: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=[REDACTED_AWS_ACCOUNT_ID]]
data.aws_ssm_parameter.teams_alerting_webhook_url: Reading...
module.ndr-ecs-fargate-app.data.aws_acm_certificate.amazon_issued[0]: Read complete after 0s [id=arn:aws:acm:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:certificate/b14e9096-bc13-4af2-ba14-988b34800503]
data.aws_elb_service_account.main: Reading...
data.aws_elb_service_account.main: Read complete after 0s [id=[REDACTED_AWS_ACCOUNT_ID]]
module.ndr-vpc-ui.data.aws_vpc.vpc[0]: Read complete after 1s [id=vpc-0dd4a5729aa76a544]
module.im-alerting-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.im-alerting-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.end_user_ods_code: Reading...
module.nhs-oauth-token-generator-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.nhs-oauth-token-generator-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_iam_policy_document.backup_assume_role: Reading...
data.aws_iam_policy_document.backup_assume_role: Read complete after 0s [id=1497918837]
data.aws_ssm_parameter.target_backup_vault_arn: Reading...
data.aws_ssm_parameter.end_user_ods_code: Read complete after 0s [id=ndr_ods_code]
data.aws_ssm_parameter.target_backup_vault_arn: Read complete after 0s [id=backup-target-vault-arn]
module.ndr-vpc-ui.data.aws_internet_gateway.ig[0]: Reading...
module.ndr-vpc-ui.data.aws_internet_gateway.ig[0]: Read complete after 0s [id=igw-09acfdf28cb9b59e0]
data.aws_ssm_parameter.backup_target_account: Reading...
data.aws_ssm_parameter.backup_target_account: Read complete after 0s [id=backup-target-account]
module.bulk-upload-report-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.bulk-upload-report-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.bulk_upload_metadata_preprocessor_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.bulk_upload_metadata_preprocessor_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.im_alerting_confluence_url: Reading...
data.aws_ssm_parameter.mns_lambda_role: Reading...
module.delete-document-object-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.delete-document-object-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.mns_lambda_role: Read complete after 0s [id=/ndr/dev/mns/lambda_role]
data.aws_iam_policy_document.splunk_trust_policy: Reading...
data.aws_iam_policy_document.splunk_trust_policy: Read complete after 0s [id=2159745497]
module.statistics_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.statistics_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=622176997]
module.statistics_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.statistics_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=3948701804]
module.zip_store_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.zip_store_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=1532202653]
module.zip_store_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.zip_store_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=11138370]
module.sqs-lg-bulk-upload-invalid-queue.data.aws_iam_policy_document.sqs_write_policy: Reading...
module.sqs-lg-bulk-upload-invalid-queue.data.aws_iam_policy_document.sqs_read_policy: Reading...
module.sqs-lg-bulk-upload-invalid-queue.data.aws_iam_policy_document.sqs_read_policy: Read complete after 0s [id=3449640083]
module.sqs-lg-bulk-upload-invalid-queue.data.aws_iam_policy_document.sqs_write_policy: Read complete after 0s [id=3714235404]
module.ndr-document-store.data.aws_iam_policy_document.s3_cloudfront_policy: Reading...
module.ndr-document-store.data.aws_iam_policy_document.s3_cloudfront_policy: Read complete after 0s [id=3900236107]
module.ndr-document-store.data.aws_iam_policy_document.s3_default_policy: Reading...
module.ndr-document-store.data.aws_iam_policy_document.s3_default_policy: Read complete after 0s [id=360773493]
module.ndr-document-store.data.aws_iam_policy_document.s3_write_policy: Reading...
module.ndr-document-store.data.aws_iam_policy_document.s3_read_policy: Reading...
module.ndr-document-store.data.aws_iam_policy_document.s3_write_policy: Read complete after 0s [id=3068440271]
module.ndr-document-store.data.aws_iam_policy_document.s3_read_policy: Read complete after 0s [id=1872237456]
module.bulk_upload_report_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.bulk_upload_report_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.bulk_upload_report_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=1743082621]
module.bulk_upload_report_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=346562578]
module.unstitched_lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.unstitched_lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=1368827665]
module.unstitched_lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.unstitched_lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=2947669308]
module.sqs-lg-bulk-upload-metadata-queue.data.aws_iam_policy_document.sqs_write_policy: Reading...
module.sqs-lg-bulk-upload-metadata-queue.data.aws_iam_policy_document.sqs_write_policy: Read complete after 0s [id=330326483]
module.sqs-lg-bulk-upload-metadata-queue.data.aws_iam_policy_document.sqs_read_policy: Reading...
module.sqs-lg-bulk-upload-metadata-queue.data.aws_iam_policy_document.sqs_read_policy: Read complete after 0s [id=621276378]
module.document_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.document_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=579347549]
module.document_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.document_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=1810050045]
module.lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=4208341431]
module.lloyd_george_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=4010983796]
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_cloudfront_policy: Reading...
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_cloudfront_policy: Read complete after 0s [id=3482994681]
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_default_policy: Reading...
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_default_policy: Read complete after 0s [id=4016232048]
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_read_policy: Reading...
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_read_policy: Read complete after 0s [id=2655275216]
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_write_policy: Reading...
module.ndr-zip-request-store.data.aws_iam_policy_document.s3_write_policy: Read complete after 0s [id=2594186720]
module.auth_state_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.auth_state_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=1454817387]
module.auth_state_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.auth_state_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=2460373747]
module.stitch_metadata_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.stitch_metadata_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=2438955140]
module.stitch_metadata_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.stitch_metadata_reference_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=3619235148]
module.sqs-splunk-queue[0].data.aws_iam_policy_document.sqs_read_policy: Reading...
module.sqs-splunk-queue[0].data.aws_iam_policy_document.sqs_write_policy: Reading...
module.sqs-splunk-queue[0].data.aws_iam_policy_document.sqs_read_policy: Read complete after 0s [id=2006270783]
module.sqs-splunk-queue[0].data.aws_iam_policy_document.sqs_write_policy: Read complete after 0s [id=850735827]
module.sqs-nrl-queue.data.aws_iam_policy_document.sqs_write_policy: Reading...
module.sqs-nrl-queue.data.aws_iam_policy_document.sqs_write_policy: Read complete after 0s [id=1836295180]
module.sqs-nrl-queue.data.aws_iam_policy_document.sqs_read_policy: Reading...
module.sqs-nrl-queue.data.aws_iam_policy_document.sqs_read_policy: Read complete after 0s [id=2696577016]
module.auth_session_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.auth_session_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=736787520]
module.auth_session_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.auth_session_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=298318938]
module.sqs-stitching-queue.data.aws_iam_policy_document.sqs_write_policy: Reading...
module.sqs-stitching-queue.data.aws_iam_policy_document.sqs_write_policy: Read complete after 0s [id=3566347893]
module.sqs-stitching-queue.data.aws_iam_policy_document.sqs_read_policy: Reading...
module.sqs-stitching-queue.data.aws_iam_policy_document.sqs_read_policy: Read complete after 0s [id=3041117273]
module.mns_encryption_key[0].data.aws_iam_policy_document.kms_key_base: Reading...
module.mns_encryption_key[0].data.aws_iam_policy_document.kms_key_base: Read complete after 0s [id=1246559937]
module.sns_encryption_key.data.aws_iam_policy_document.kms_key_base: Reading...
module.sns_encryption_key.data.aws_iam_policy_document.kms_key_base: Read complete after 0s [id=1357524363]
module.statistical-reports-store.data.aws_iam_policy_document.s3_cloudfront_policy: Reading...
module.statistical-reports-store.data.aws_iam_policy_document.s3_cloudfront_policy: Read complete after 0s [id=1117457744]
module.statistical-reports-store.data.aws_iam_policy_document.s3_default_policy: Reading...
module.statistical-reports-store.data.aws_iam_policy_document.s3_default_policy: Read complete after 0s [id=1914142253]
module.statistical-reports-store.data.aws_iam_policy_document.s3_write_policy: Reading...
module.statistical-reports-store.data.aws_iam_policy_document.s3_write_policy: Read complete after 0s [id=3364242781]
module.statistical-reports-store.data.aws_iam_policy_document.s3_read_policy: Reading...
module.statistical-reports-store.data.aws_iam_policy_document.s3_read_policy: Read complete after 0s [id=1321224475]
module.cloudfront_edge_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.cloudfront_edge_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=878193642]
module.cloudfront_edge_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.cloudfront_edge_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=2966557138]
module.access_audit_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Reading...
module.access_audit_dynamodb_table.data.aws_iam_policy_document.dynamodb_read_policy: Read complete after 0s [id=3320398166]
module.access_audit_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Reading...
module.access_audit_dynamodb_table.data.aws_iam_policy_document.dynamodb_write_policy: Read complete after 0s [id=2269967759]
module.ndr-app-config.data.aws_iam_policy_document.app_config_policy: Reading...
module.ndr-app-config.data.aws_iam_policy_document.app_config_policy: Read complete after 0s [id=3124192233]
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_cloudfront_policy: Reading...
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_cloudfront_policy: Read complete after 0s [id=4010102892]
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_default_policy: Reading...
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_default_policy: Read complete after 0s [id=4294257910]
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_read_policy: Reading...
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_read_policy: Read complete after 0s [id=571650583]
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_write_policy: Reading...
module.ndr-bulk-staging-store.data.aws_iam_policy_document.s3_write_policy: Read complete after 0s [id=2459984747]
module.mns_encryption_key[0].data.aws_iam_policy_document.kms_key_generate[0]: Reading...
module.mns_encryption_key[0].data.aws_iam_policy_document.kms_key_generate[0]: Read complete after 0s [id=3056223013]
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_read_policy: Reading...
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_read_policy: Read complete after 0s [id=3771123994]
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_write_policy: Reading...
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_write_policy: Read complete after 0s [id=1401231672]
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_default_policy: Reading...
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_default_policy: Read complete after 0s [id=4030053425]
module.sns_encryption_key.data.aws_iam_policy_document.combined_policy_documents: Reading...
module.sns_encryption_key.data.aws_iam_policy_document.combined_policy_documents: Read complete after 0s [id=1357524363]
data.aws_iam_policy_document.logs_bucket_policy: Reading...
data.aws_iam_policy_document.logs_bucket_policy: Read complete after 0s [id=1756347120]
module.mns_encryption_key[0].data.aws_iam_policy_document.combined_policy_documents: Reading...
module.mns_encryption_key[0].data.aws_iam_policy_document.combined_policy_documents: Read complete after 0s [id=909322257]
module.edge-presign-lambda.data.aws_iam_policy_document.lambda_policy: Reading...
module.edge-presign-lambda.data.aws_iam_policy_document.lambda_policy: Read complete after 0s [id=224743285]
module.bulk-upload-report-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.bulk-upload-report-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3829647446]
module.nhs-oauth-token-generator-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.nhs-oauth-token-generator-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=2717293737]
data.aws_ssm_parameter.slack_alerting_channel_id: Still reading... [10s elapsed]
data.aws_ssm_parameter.slack_alerting_bot_token: Still reading... [10s elapsed]
data.aws_ssm_parameter.teams_alerting_webhook_url: Still reading... [10s elapsed]
module.bulk-upload-metadata-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.bulk-upload-metadata-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=2971656376]
module.bulk_upload_metadata_preprocessor_lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.bulk_upload_metadata_preprocessor_lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1276721986]
data.aws_ssm_parameter.im_alerting_confluence_url: Still reading... [10s elapsed]
module.pdf-stitching-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.pdf-stitching-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=2004385192]
module.delete-document-object-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.delete-document-object-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1373152877]
module.login_redirect_lambda.data.archive_file.lambda: Reading...
module.login_redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.authoriser-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.authoriser-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.login_redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.login_redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.authoriser-lambda.data.archive_file.lambda: Reading...
module.authoriser-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.manage-nrl-pointer-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.manage-nrl-pointer-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.manage-nrl-pointer-lambda.data.archive_file.lambda: Reading...
module.manage-nrl-pointer-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.login_redirect_lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.login_redirect_lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3789573361]
module.authoriser-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.authoriser-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3112707147]
module.manage-nrl-pointer-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.manage-nrl-pointer-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3271777332]
module.get-doc-nrl-lambda.data.archive_file.lambda: Reading...
module.get-doc-nrl-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.get-doc-nrl-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.get-doc-nrl-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.get-doc-nrl-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.get-doc-nrl-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=80611351]
module.statistical-report-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.statistical-report-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.statistical-report-lambda.data.archive_file.lambda: Reading...
module.statistical-report-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.sqs-mns-notification-queue[0].data.aws_iam_policy_document.sqs_write_policy: Reading...
module.sqs-mns-notification-queue[0].data.aws_iam_policy_document.sqs_write_policy: Read complete after 0s [id=2057677087]
module.sqs-mns-notification-queue[0].data.aws_iam_policy_document.sqs_read_policy: Reading...
module.sqs-mns-notification-queue[0].data.aws_iam_policy_document.sqs_read_policy: Read complete after 0s [id=95566483]
module.create-token-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create-token-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.create-token-lambda.data.archive_file.lambda: Reading...
module.back_channel_logout_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.back_channel_logout_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.create-token-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.back_channel_logout_lambda.data.archive_file.lambda: Reading...
module.back_channel_logout_lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.statistical-report-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.statistical-report-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=2574060605]
data.aws_iam_policy_document.assume_role_policy_for_get_doc_ref_lambda: Reading...
data.aws_iam_policy_document.assume_role_policy_for_get_doc_ref_lambda: Read complete after 0s [id=2904261847]
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_cloudfront_policy: Reading...
module.ndr-lloyd-george-store.data.aws_iam_policy_document.s3_cloudfront_policy: Read complete after 0s [id=1665589318]
module.back_channel_logout_lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.back_channel_logout_lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=780367278]
module.create-token-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.create-token-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=898686943]
module.mns-notification-lambda[0].data.aws_iam_policy_document.merged_policy: Reading...
module.mns-notification-lambda[0].data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3527214111]
module.generate-document-manifest-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.generate-document-manifest-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.generate-document-manifest-lambda.data.archive_file.lambda: Reading...
module.generate-lloyd-george-stitch-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.generate-lloyd-george-stitch-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.generate-document-manifest-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.data-collection-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.data-collection-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.data-collection-lambda.data.archive_file.lambda: Reading...
module.data-collection-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.generate-lloyd-george-stitch-lambda.data.archive_file.lambda: Reading...
module.generate-lloyd-george-stitch-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.bulk-upload-lambda.data.archive_file.lambda: Reading...
module.bulk-upload-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.search-patient-details-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.search-patient-details-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.bulk-upload-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.bulk-upload-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.search-patient-details-lambda.data.archive_file.lambda: Reading...
module.search-patient-details-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.lloyd-george-stitch-lambda.data.archive_file.lambda: Reading...
module.lloyd-george-stitch-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.lloyd-george-stitch-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.lloyd-george-stitch-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.feature-flags-lambda.data.archive_file.lambda: Reading...
module.feature-flags-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.feature-flags-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.feature-flags-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.virus_scan_result_lambda.data.archive_file.lambda: Reading...
module.upload_confirm_result_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.upload_confirm_result_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.virus_scan_result_lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.upload_confirm_result_lambda.data.archive_file.lambda: Reading...
module.upload_confirm_result_lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.virus_scan_result_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.search-document-references-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.virus_scan_result_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.search-document-references-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.search-document-references-lambda.data.archive_file.lambda: Reading...
module.search-document-references-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.generate-document-manifest-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.generate-document-manifest-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=317564277]
module.generate-lloyd-george-stitch-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.generate-lloyd-george-stitch-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=4074283702]
module.data-collection-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.data-collection-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1332845882]
module.bulk-upload-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.bulk-upload-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3617188]
module.search-patient-details-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.search-patient-details-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=2238435705]
module.create-doc-ref-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create-doc-ref-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.create-doc-ref-lambda.data.archive_file.lambda: Reading...
module.create-doc-ref-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.lloyd-george-stitch-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.lloyd-george-stitch-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=2834094320]
module.feature-flags-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.feature-flags-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3124192233]
module.get-report-by-ods-lambda.data.archive_file.lambda: Reading...
module.get-report-by-ods-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.get-report-by-ods-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.get-report-by-ods-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.virus_scan_result_lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.virus_scan_result_lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=751398689]
module.search-document-references-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.search-document-references-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1088156246]
module.upload_confirm_result_lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.upload_confirm_result_lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=3997285093]
module.update-upload-state-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.update-upload-state-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.update-upload-state-lambda.data.archive_file.lambda: Reading...
module.update-upload-state-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.create-doc-ref-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.create-doc-ref-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1356722845]
module.send-feedback-lambda.data.archive_file.lambda: Reading...
module.send-feedback-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.send-feedback-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.send-feedback-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.access-audit-lambda.data.archive_file.lambda: Reading...
module.access-audit-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.access-audit-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.access-audit-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.get-report-by-ods-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.get-report-by-ods-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1012747500]
module.document-manifest-job-lambda.data.archive_file.lambda: Reading...
module.document-manifest-job-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.document-manifest-job-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.document-manifest-job-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.update-upload-state-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.update-upload-state-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=861476337]
module.send-feedback-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.send-feedback-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=923076430]
module.access-audit-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.access-audit-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=563124403]
module.document-manifest-job-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.document-manifest-job-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=943257204]
data.aws_iam_policy_document.assume_role_policy_for_stitch_lambda: Reading...
data.aws_iam_policy_document.assume_role_policy_for_stitch_lambda: Read complete after 0s [id=69626593]
data.aws_iam_policy_document.assume_role_policy_for_create_lambda: Reading...
data.aws_iam_policy_document.assume_role_policy_for_create_lambda: Read complete after 0s [id=280257580]
data.aws_iam_policy_document.assume_role_policy_for_ods_report_lambda: Reading...
data.aws_iam_policy_document.assume_role_policy_for_ods_report_lambda: Read complete after 0s [id=2415058836]
data.aws_ssm_parameter.slack_alerting_channel_id: Still reading... [20s elapsed]
data.aws_iam_policy_document.assume_role_policy_for_manifest_lambda: Reading...
data.aws_iam_policy_document.assume_role_policy_for_manifest_lambda: Read complete after 0s [id=1250203384]
module.delete-doc-ref-lambda.data.archive_file.lambda: Reading...
module.delete-doc-ref-lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
module.delete-doc-ref-lambda.data.aws_iam_policy_document.assume_role: Reading...
module.delete-doc-ref-lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.delete-doc-ref-lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.delete-doc-ref-lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=1171142345]
data.aws_ssm_parameter.slack_alerting_bot_token: Still reading... [20s elapsed]
module.logout_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.logout_lambda.data.archive_file.lambda: Reading...
module.logout_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.logout_lambda.data.archive_file.lambda: Read complete after 0s [id=18308a8cd989c9d4095f4454d7f32f87e6c57542]
data.aws_ssm_parameter.teams_alerting_webhook_url: Still reading... [20s elapsed]
module.logout_lambda.data.aws_iam_policy_document.merged_policy: Reading...
module.logout_lambda.data.aws_iam_policy_document.merged_policy: Read complete after 0s [id=780367278]
data.aws_ssm_parameter.im_alerting_confluence_url: Still reading... [20s elapsed]
data.aws_ssm_parameter.slack_alerting_channel_id: Still reading... [30s elapsed]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.edge-presign-lambda.aws_lambda_function.lambda has changed
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "ndr-dev_EdgePresignLambda"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_EdgePresignLambda:195" -> "arn:aws:lambda:us-east-1:[REDACTED_AWS_ACCOUNT_ID]:function:ndr-dev_EdgePresignLambda:196"
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_api_gateway_deployment.ndr_api_deploy must be replaced
+/- resource "aws_api_gateway_deployment" "ndr_api_deploy" {
      ~ created_date  = "2025-05-23T09:26:00Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ccy0v3rve9/" -> (known after apply)
      ~ id            = "8suyv5" -> (known after apply)
      ~ invoke_url    = "[REDACTED_API_GATEWAY_URL]" -> (known after apply)
      ~ variables     = {
          - "deployed_at" = "2025-05-23T09:26:00Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.ndr_api will be updated in-place
  ~ resource "aws_api_gateway_stage" "ndr_api" {
      ~ deployment_id         = "8suyv5" -> (known after apply)
        id                    = "ags-ccy0v3rve9-dev"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.error_count_high will be created
  + resource "aws_cloudwatch_metric_alarm" "error_count_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-search_patient_details_alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]21",
        ]
      + alarm_description                     = "Triggers when search patient lambda error count is about 7"
      + alarm_name                            = "search_patient_error_count_high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-search_patient_details_alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]21",
        ]
      + tags                                  = {
          + "alarm_group"   = "ndr-dev_SearchPatientDetailsLambda"
          + "alarm_metric"  = "Errors"
          + "alerting_type" = "KPI"
          + "severity"      = "high"
        }
      + tags_all                              = {
          + "alarm_group"   = "ndr-dev_SearchPatientDetailsLambda"
          + "alarm_metric"  = "Errors"
          + "alerting_type" = "KPI"
          + "severity"      = "high"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "ndr-dev_SearchPatientDetailsLambda"
                }
              + metric_name = "Errors"
              + namespace   = "AWS/Lambda"
              + period      = 120
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "IF(m1 >= 7, 1, 0)"
          + id          = "error"
          + label       = "error count for search patient, high if above 7"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.error_count_low will be created
  + resource "aws_cloudwatch_metric_alarm" "error_count_low" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-search_patient_details_alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]21",
        ]
      + alarm_description                     = "Triggers when search patient lambda error count is between 1 and 3 within 2mins"
      + alarm_name                            = "search_patient_error_count_low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-search_patient_details_alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]21",
        ]
      + tags                                  = {
          + "alarm_group"   = "ndr-dev_SearchPatientDetailsLambda"
          + "alarm_metric"  = "Errors"
          + "alerting_type" = "KPI"
          + "severity"      = "low"
        }
      + tags_all                              = {
          + "alarm_group"   = "ndr-dev_SearchPatientDetailsLambda"
          + "alarm_metric"  = "Errors"
          + "alerting_type" = "KPI"
          + "severity"      = "low"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "ndr-dev_SearchPatientDetailsLambda"
                }
              + metric_name = "Errors"
              + namespace   = "AWS/Lambda"
              + period      = 120
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "IF(m1 >= 1 AND m1 <= 3, 1, 0)"
          + id          = "error"
          + label       = "error count for search patient, low if between 1 and 3"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_metric_alarm.error_count_medium will be created
  + resource "aws_cloudwatch_metric_alarm" "error_count_medium" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-search_patient_details_alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]21",
        ]
      + alarm_description                     = "Triggers when search patient lambda error count is between 4 and 6 within 2mins"
      + alarm_name                            = "search_patient_error_count_medium"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-search_patient_details_alarms-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]21",
        ]
      + tags                                  = {
          + "alarm_group"   = "ndr-dev_SearchPatientDetailsLambda"
          + "alarm_metric"  = "Errors"
          + "alerting_type" = "KPI"
          + "severity"      = "medium"
        }
      + tags_all                              = {
          + "alarm_group"   = "ndr-dev_SearchPatientDetailsLambda"
          + "alarm_metric"  = "Errors"
          + "alerting_type" = "KPI"
          + "severity"      = "medium"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "m1"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "FunctionName" = "ndr-dev_SearchPatientDetailsLambda"
                }
              + metric_name = "Errors"
              + namespace   = "AWS/Lambda"
              + period      = 120
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "IF(m1 >= 4 AND m1 <= 6, 1, 0)"
          + id          = "error"
          + label       = "error count for search patient, medium if between 4 and 6"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_iam_policy.alerting_lambda_alarms will be created
  + resource "aws_iam_policy" "alerting_lambda_alarms" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Alarms policy to allow lambda to describe all alarms"
      + id               = (known after apply)
      + name             = "ndr-dev_alerting_lambda_alarms_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:DescribeAlarms",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_sns_topic_subscription.alarm_notifications_sns_topic_subscription["abbas.khan10@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "alarm_notifications_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "abbas.khan10@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-alarms-notification-topic-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]14"
    }

  # aws_sns_topic_subscription.alarm_notifications_sns_topic_subscription["noga.sasson1@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "alarm_notifications_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "noga.sasson1@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-alarms-notification-topic-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]14"
    }

  # aws_sns_topic_subscription.alarm_notifications_sns_topic_subscription["rob.gaskin1@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "alarm_notifications_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "rob.gaskin1@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-alarms-notification-topic-[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]14"
    }

  # module.alarm_state_history_table.data.aws_iam_policy_document.dynamodb_read_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb_read_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.alarm_state_history_table.data.aws_iam_policy_document.dynamodb_write_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb_write_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.alarm_state_history_table.aws_dynamodb_table.ndr_dynamodb_table will be created
  + resource "aws_dynamodb_table" "ndr_dynamodb_table" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "AlarmNameMetric"
      + id                          = (known after apply)
      + name                        = "ndr-dev_AlarmStateHistory"
      + range_key                   = "TimeCreated"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_enabled              = false
      + stream_label                = (known after apply)
      + stream_view_type            = "NEW_AND_OLD_IMAGES"
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "ndr-dev_AlarmStateHistory"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "ndr-dev_AlarmStateHistory"
          + "Owner"       = "nhse/ndr-team"
          + "Workspace"   = "ndr-dev"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "AlarmNameMetric"
          + type = "S"
        }
      + attribute {
          + name = "TimeCreated"
          + type = "N"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = true
        }
    }

  # module.alarm_state_history_table.aws_iam_policy.dynamodb_policy will be created
  + resource "aws_iam_policy" "dynamodb_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ndr-dev_AlarmStateHistory_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.im-alerting-lambda.data.aws_iam_policy_document.merged_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "merged_policy" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ssm:GetParameter",
                              + "ssm:GetParameters",
                              + "ssm:PutParameter",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:ssm:*:*:parameter/*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "cloudwatch:DescribeAlarms",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:cloudwatch:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:alarm:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "appconfig:StartConfigurationSession",
                              + "appconfig:GetLatestConfiguration",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:appconfig:*:*:application/cbe8t8t/environment/w3zulwr/configuration/tsaegbq"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + (known after apply),
        ]
    }

  # module.im-alerting-lambda.aws_iam_policy.combined_policies will be created
  + resource "aws_iam_policy" "combined_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ndr-dev_IMAlertingLambda_combined_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.im-alerting-lambda.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ndr-dev_lambda_execution_role_IMAlertingLambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.im-alerting-lambda.aws_iam_role_policy_attachment.default_policies["arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "default_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "ndr-dev_lambda_execution_role_IMAlertingLambda"
    }

  # module.im-alerting-lambda.aws_iam_role_policy_attachment.default_policies["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"] will be created
  + resource "aws_iam_role_policy_attachment" "default_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "ndr-dev_lambda_execution_role_IMAlertingLambda"
    }

  # module.im-alerting-lambda.aws_iam_role_policy_attachment.lambda_execution_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ndr-dev_lambda_execution_role_IMAlertingLambda"
    }

  # module.mns-dlq-alarm-topic.aws_sns_topic_subscription.sns_subscription_list["abbas.khan10@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "sns_subscription_list" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "abbas.khan10@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-mns-dlq-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]03"
    }

  # module.mns-dlq-alarm-topic.aws_sns_topic_subscription.sns_subscription_list["noga.sasson1@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "sns_subscription_list" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "noga.sasson1@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-mns-dlq-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]03"
    }

  # module.mns-dlq-alarm-topic.aws_sns_topic_subscription.sns_subscription_list["rob.gaskin1@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "sns_subscription_list" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "rob.gaskin1@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-2:[REDACTED_AWS_ACCOUNT_ID]:ndr-dev-sns-mns-dlq-topic[REDACTED_AWS_ACCOUNT_ID][REDACTED_AWS_ACCOUNT_ID]03"
    }

  # module.mns-dlq-alarm-topic.aws_sns_topic_subscription.sns_subscription_list["stephane.torres1@nhs.net"] will be created
  + resource "aws_sns_topic_subscription" "sns_subscription_list" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "stephane.torres1@nhs.net"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id
(truncated - see workflow logs for full output)
```

</details>